/* «адание 7
    ≈сть некоторый массив из целых положительних чисел. [1, 0, 4, 8, 9, 1]
    Ќеобходимо написать программу котора€ посчитает максимально возможную сумму
    которую можно получить из данного массива, с условием что элементы включенные в
    сумму не должны сто€ть на соседних индексах (должен быть минимум один елемент
    между ними).
 */
public class SSS {
    public static void main(String[] args) {
        //  int[] reating = {1, 2, 3, 4, 5, 3, 2, 1, 2, 6, 5, 4, 3, 3, 2, 1, 1, 3, 3, 3, 4, 2};
      //  int[] money =  {1, 2, 3, 4, 5, 3, 2, 1, 2, 4, 3, 2, 1, 3, 2, 1, 1, 2, 1, 1, 2, 1};

    }
    }